In [3]:
import pandas as pd
import numpy as np

In [103]:
df = pd.read_csv('Data/student.csv')

In [5]:
df[:2]

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male

In [6]:
df.iloc[0,0] = 4
df.head()

   id        name  class  mark  gender
0   4    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [9]:
df.drop('class', axis=1, inplace=True)
df.head()

   id        name  mark  gender
0   4    John Deo    75  female
1   2    Max Ruin    85    male
2   3      Arnold    55    male
3   4  Krish Star    60  female
4   5   John Mike    60  female

In [21]:
df.iloc[-1,0]

35

In [29]:
df['class'] = np.random.rand(35)

In [30]:
df.head()

   id        name  mark  gender     class
0   4    John Deo    75  female  0.139508
1   2    Max Ruin    85    male  0.922293
2   3      Arnold    55    male  0.563177
3   4  Krish Star    60  female  0.363877
4   6      Aniket   100    male  0.684884

In [31]:
df.insert(2, "Age", np.random.rand(35), True)
df.head()

   id        name       Age  mark  gender     class
0   4    John Deo  0.173067    75  female  0.139508
1   2    Max Ruin  0.204250    85    male  0.922293
2   3      Arnold  0.102892    55    male  0.563177
3   4  Krish Star  0.964130    60  female  0.363877
4   6      Aniket  0.534326   100    male  0.684884

In [104]:
df.iloc[0,0] = None

In [115]:
df.head()

    id        name  class  mark  gender
0  NaN    John Deo   Four     4  female
1  2.0    Max Ruin  Three     4    male
2  3.0      Arnold  Three     4    male
3  4.0  Krish Star   Four     4  female
4  5.0   John Mike   Four     4  female

In [84]:
df = df.fillna(1000)

In [114]:
df.loc[df['mark'] == 1000, 'mark'] = 4

In [117]:
df['mark'].value_counts()

4    35
Name: mark, dtype: int64